OpenFOAM-7-master/test/multiphase/reactingTwoPhaseEulerFoam/interfaceComposition/waterAndIsopropanolEvaporation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingTwoPhaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.005;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1;

functions
{
    plot
    {
        lib             ("libsampling.so");
        type            probes;
        writeControl    timeStep;
        writeInterval   1;
        fields
        (
            air.gas
            alpha.gas
            alpha.liquid
            H2O.gas
            H2O.liquid
            C3H8O.gas
            C3H8O.liquid
            p
            T.gas
            T.liquid
        );
        probeLocations  ((0 0 0));
    }
}


// ************************************************************************* //
